const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({

    pattern: "menu",

    react: "🛸",

    alias: ["panel","commands"],

    desc: "Get bot\'s command list.",

    category: "main",

    use: '.menu',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let madeMenu = `╭━━━━∙⋆⋅⋆∙━ ─┉─ • ─┉─⊷

*⇆ 𝐇𝐈𝐈 𝐌𝐘 𝐃𝐄𝐀𝐑 𝐅𝐑𝐈𝐄𝐍𝐃 ⇆*

     *${𝐩𝐮𝐬𝐡𝐧𝐚𝐦𝐞}*
     
╰━━━━∙⋆⋅⋆∙━ ─┉─ • ─┉─⊷
┏━━━━━━━━━━━━━━━━━━━━━━━━━━
      *𝐖𝐄𝐋𝐂𝐎𝐌𝐄 𝐓𝐎 𝐏𝐀𝐍𝐇𝐖𝐀𝐑 𝐅𝐔𝐋𝐋 𝐂𝐎𝐌𝐌𝐀𝐍𝐃 𝐋𝐈𝐒𝐓*
┗━━━━━━━━━━━━━━━━━━━━━━━━━━

*𝐂𝐑𝐄𝐀𝐓𝐄𝐃 𝐁𝐘 𝐀𝐍𝐒𝐀𝐑-𝐏𝐀𝐍𝐇𝐖𝐀𝐑*

*┌─〈 ${config.BOT_NAME} 〉─◆*
*│╭─────────────···▸*
*┴│▸*
*❖│▸* *𝐑𝐔𝐍𝐓𝐈𝐌𝐄* : ${runtime(process.uptime())}
*❖│▸* *𝐌𝐎𝐃𝐄* : *[${config.MODE}]*
*❖│▸* *𝐏𝐑𝐄𝐅𝐈𝐗* : *[${config.PREFIX}]*
*❖│▸* *𝐑𝐀𝐌 𝐔𝐒𝐄* : ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB
*❖│▸* *𝐍𝐀𝐌𝐄 𝐁𝐎𝐓* : *𝐏𝐀𝐍𝐇𝐖𝐀𝐑*
*❖│▸* *𝐂𝐑𝐄𝐀𝐓𝐎𝐑* : *𝐀𝐍𝐒𝐀𝐑-𝐏𝐀𝐍𝐇𝐖𝐀𝐑*
*❖│▸* *𝐕𝐄𝐑𝐒𝐈𝐎𝐍𝐒* : *𝐯.2.0.0*
*❖│▸* *𝐌𝐄𝐍𝐔 𝐂𝐌𝐃* : *𝐌𝐄𝐍𝐔 𝐋𝐈𝐒𝐓*
*┬│▸*
*│╰────────────···▸▸*
*└──────────────···▸*
*♡︎•━━━━━━☻︎━━━━━━•♡︎*

*╭────❒⁠⁠⁠⁠* *📥 𝐃𝐎𝐖𝐍𝐋𝐎𝐀𝐃𝐄𝐑-𝐂𝐌𝐃 📥* *❒⁠⁠⁠⁠* 
*┋* *.𝐅𝐁 <𝐔𝐑𝐋>*
*┋* *.𝐈𝐍𝐒𝐓𝐀 <𝐔𝐑𝐋>*
*┋* *.𝐕𝐈𝐃𝐄𝐎 <𝐔𝐑𝐋>*
*┋* *.𝐆𝐃𝐑𝐈𝐕𝐄 <𝐔𝐑𝐋>*
*┋* *.𝐓𝐖𝐈𝐓𝐓𝐄𝐑 <𝐔𝐑𝐋>*
*┋* *.𝐓𝐓 <𝐔𝐑𝐋>*
*┋* *.𝐌𝐄𝐃𝐈𝐀𝐅𝐈𝐑𝐄 <𝐔𝐑𝐋>*
*┋* *.𝐒𝐎𝐍𝐆 <𝐐𝐔𝐑𝐄𝐘>*
*┋* *.𝐏𝐋𝐀𝐘 <𝐔𝐑𝐋>*
*┋* *.𝐕𝐈𝐃𝐄𝐎 <𝐐𝐔𝐄𝐑𝐘>*
*┋* *.𝐕𝐈𝐃𝐄𝐎2 <𝐔𝐑𝐋>*
*┋* *.𝐈𝐌𝐆 <𝐐𝐔𝐑𝐄𝐘>*
*┋* *.𝐀𝐏𝐊 <𝐍𝐀𝐌𝐄>*
*┋* *.𝐃𝐀𝐑𝐀𝐌𝐀 <𝐓𝐈𝐓𝐓𝐋𝐄>*
*┋* *.𝐏𝐋𝐀𝐘2 <𝐓𝐈𝐓𝐓𝐋𝐄>*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🔎 𝐒𝐄𝐀𝐑𝐂𝐇-𝐂𝐌𝐃 🔍* *❒⁠⁠⁠⁠* 
*┋* *.𝐘𝐓𝐒  <𝐓𝐄𝐗𝐓>*
*┋* *.𝐋𝐎𝐋𝐈 <𝐓𝐄𝐗𝐓>*
*┋* *.𝐌𝐎𝐕𝐈𝐄 <𝐓𝐄𝐗𝐓>*
*┋* *.𝐈𝐌𝐆 <𝐓𝐄𝐗𝐓>*
*┋* *.𝐖𝐄𝐀𝐓𝐇𝐄𝐑 <𝐂𝐈𝐓𝐘>*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🧠 𝐀𝐈-𝐂𝐌𝐃 🧠* *❒⁠⁠⁠⁠* 
*┋* *.𝐆𝐏𝐓 <𝐓𝐄𝐗𝐓>*
*┋* *.𝐀𝐈 <𝐓𝐄𝐗𝐓>*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *👨‍💻 𝐎𝐖𝐍𝐄𝐑-𝐂𝐌𝐃 👨‍💻* *❒⁠⁠⁠⁠* 
*┋* *.𝐔𝐏𝐃𝐀𝐓𝐄𝐂𝐌𝐃*
*┋* *.𝐎𝐖𝐍𝐄𝐑*
*┋* *.𝐑𝐄𝐏𝐎*
*┋* *.𝐒𝐘𝐒𝐓𝐄𝐌*
*┋* *.𝐒𝐓𝐀𝐓𝐔𝐒*
*┋* *.𝐁𝐋𝐎𝐂𝐊*
*┋* *.𝐔𝐍𝐁𝐋𝐎𝐂𝐊*
*┋* *.𝐒𝐇𝐔𝐓𝐃𝐎𝐖𝐍*
*┋* *.𝐂𝐋𝐄𝐀𝐑𝐂𝐇𝐀𝐓𝐒*
*┋* *.𝐒𝐄𝐓𝐏𝐏*
*┋* *.𝐁𝐑𝐎𝐀𝐃𝐂𝐀𝐒𝐓*
*┋* *.𝐉𝐈𝐃*
*┋* *.𝐆𝐉𝐈𝐃*
*┋* *.𝐑𝐄𝐒𝐓𝐀𝐑𝐓*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *👥 𝐆𝐑𝐎𝐔𝐏-𝐂𝐌𝐃 👥* *❒⁠⁠⁠⁠* 
*┋* *.𝐑𝐄𝐌𝐎𝐕𝐄 <𝐑𝐄𝐏𝐋𝐘 𝐅𝐎𝐑 𝐃𝐄𝐋𝐄𝐓𝐄 𝐒𝐌𝐒>*
*┋* *.𝐃𝐄𝐋𝐄𝐓𝐄 <𝐑𝐄𝐏𝐋𝐘 𝐅𝐎𝐑 𝐃𝐄𝐋𝐄𝐓𝐄 𝐒𝐌𝐒>*
*┋* *.𝐀𝐃𝐃*
*┋* *.𝐊𝐈𝐂𝐊*
*┋* *.𝐒𝐄𝐓𝐆𝐎𝐎𝐃𝐁𝐘𝐑 <𝐓𝐄𝐗𝐓>*
*┋* *.𝐒𝐄𝐓𝐖𝐄𝐋𝐂𝐎𝐌𝐄 <𝐓𝐄𝐗𝐓>*
*┋* *.𝐏𝐑𝐎𝐌𝐎𝐓𝐄*
*┋* *.𝐃𝐄𝐌𝐎𝐓𝐑*
*┋* *.𝐓𝐀𝐆𝐀𝐋𝐋*
*┋* *.𝐆𝐄𝐓𝐏𝐈𝐂*
*┋* *.𝐈𝐍𝐕𝐈𝐓𝐄*
*┋* *.𝐑𝐄𝐕𝐎𝐀𝐊𝐄*
*┋* *.𝐉𝐎𝐈𝐍𝐑𝐄𝐐𝐔𝐄𝐒𝐓𝐒*
*┋* *.𝐀𝐋𝐋𝐑𝐄𝐐*
*┋* *.𝐌𝐔𝐓𝐄*
*┋* *.𝐔𝐍𝐌𝐔𝐓𝐄*
*┋* *.𝐋𝐎𝐂𝐊𝐆𝐂*
*┋* *.𝐔𝐍𝐋𝐎𝐂𝐊𝐆𝐂*
*┋* *.𝐋𝐄𝐀𝐕𝐄*
*┋* *.𝐔𝐏𝐃𝐀𝐓𝐄𝐆𝐍𝐀𝐌𝐄*
*┋* *.𝐔𝐏𝐃𝐀𝐓𝐄𝐆𝐃𝐄𝐒𝐂*
*┋* *.𝐉𝐎𝐈𝐍*
*┋* *.𝐇𝐈𝐃𝐄𝐓𝐀𝐆*
*┋* *.𝐆𝐈𝐈𝐍𝐅𝐎*
*┋* *.𝐃𝐈𝐒𝐀𝐏𝐏𝐄𝐀𝐑 𝐎𝐍*
*┋* *.𝐃𝐈𝐒𝐀𝐏𝐏𝐄𝐀𝐑 𝐎𝐅𝐅*
*┋* *.𝐃𝐈𝐒𝐀𝐏𝐏𝐄𝐀𝐑 7𝐃 24𝐇 90𝐃*
*┋* *.𝐒𝐄𝐍𝐃𝐃𝐌*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *📃 𝐈𝐍𝐅𝐎-𝐂𝐌𝐃 📃* *❒⁠⁠⁠⁠* 
*┋* *.𝐌𝐄𝐍𝐔*
*┋* *.𝐌𝐄𝐍𝐔2*
*┋* *.𝐌𝐄𝐍𝐔3*
*┋* *.𝐀𝐁𝐎𝐔𝐓*
*┋* *.𝐒𝐂𝐑𝐈𝐏𝐓*
*┋* *.𝐑𝐄𝐎𝐏*
*┋* *.𝐀𝐋𝐈𝐕𝐄*
*┋* *.𝐁𝐎𝐓𝐈𝐍𝐅𝐎*
*┋* *.𝐒𝐓𝐀𝐓𝐔𝐒*
*┋* *.𝐒𝐔𝐏𝐏𝐎𝐑𝐓*
*┋* *.𝐏𝐈𝐍𝐆*
*┋* *.𝐏𝐈𝐍𝐆2*
*┋* *.𝐒𝐘𝐒𝐓𝐄𝐌*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🎡 𝐂𝐎𝐍𝐕𝐄𝐑𝐓𝐄𝐑-𝐂𝐌𝐃 🎡* *❒⁠⁠⁠⁠* 
*┋* *.𝐒𝐓𝐈𝐂𝐊𝐄𝐑*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *⛱️ 𝐑𝐀𝐍𝐃𝐎𝐌-𝐂𝐌𝐃 ⛱️* *❒⁠⁠⁠⁠* 
*┋* *.𝐊𝐈𝐍𝐆*
*┋* *.𝐃𝐎𝐆*
*┋* *.𝐀𝐍𝐈𝐌𝐄*
*┋* *.𝐀𝐍𝐈𝐌𝐄𝐆𝐈𝐑𝐋*
*┋* *.𝐀𝐍𝐈𝐌𝐄𝐆𝐈𝐑𝐋1*
*┋* *.𝐀𝐍𝐈𝐌𝐄𝐆𝐈𝐑𝐋2*
*┋* *.𝐀𝐍𝐈𝐌𝐄𝐆𝐈𝐑𝐋3*
*┋* *.𝐀𝐍𝐈𝐌𝐄𝐆𝐈𝐑𝐋4*
*┋* *.𝐀𝐍𝐈𝐌𝐄𝐆𝐈𝐑𝐋5*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🏜️ 𝐖𝐀𝐋𝐋𝐏𝐀𝐏𝐄𝐑𝐒-𝐂𝐌𝐃 🏜️* *❒⁠⁠⁠⁠* 
*┋* *.𝐈𝐌𝐆*
*┕───────────────────❒*

*╭────❒⁠⁠⁠⁠* *🌐 𝐎𝐓𝐇𝐄𝐑-𝐂𝐌𝐃 🌐* *❒⁠⁠⁠⁠* 
*┋* *.𝐓𝐑𝐓*
*┋* *.𝐉𝐎𝐊𝐄*
*┋* *.𝐌𝐎𝐕𝐈𝐄*
*┋* *.𝐅𝐀𝐂𝐓*
*┋* *.𝐆𝐈𝐓𝐇𝐔𝐁𝐒𝐓𝐀𝐋𝐊*
*┋* *.𝐆𝐏𝐀𝐒𝐒*
*┋* *.𝐇𝐀𝐂𝐊*
*┋* *.𝐐𝐔𝐎𝐓𝐄*
*┋* *.𝐒𝐑𝐄𝐏𝐎*
*┋* *.𝐃𝐄𝐅𝐈𝐍𝐄*
*┕───────────────────❒*


*╭────❒⁠⁠⁠⁠* *🪲 𝐁𝐔𝐆𝐒-𝐂𝐌𝐃 🐛* *❒⁠⁠⁠⁠* 
*┋* *.𝐁𝐔𝐆1*(92**********)
*┋* *.𝐁𝐔𝐆2*(92**********)
*┋* *.𝐁𝐔𝐆3*(92**********)
*┋* *.𝐁𝐔𝐆4*(92**********)
*┋* *.𝐁𝐔𝐆5*(92**********)
*┋* *.𝐁𝐔𝐆6*(92**********)
*┕───────────────────❒*

*❒⁠⁠⁠⁠▭▬▭▬▭▬▭▬▭▬▭▬▭❒*⁠⁠⁠⁠

┏━━━━━━━━━━━━━━━━━━━
*https://whatsapp.com/channel/0029ValASu1IN9ifummBKW1U*
┗━━━━━━━━━━━━━━━━━━━


> *𝐏𝐎𝐖𝐄𝐑𝐄𝐃 𝐁𝐘 𝐏𝐀𝐍𝐇𝐖𝐀𝐑*
╘✦•·········•••••••••············•✦ 
`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:madeMenu},{quoted:mek})

}catch(e){
console.log(e)
reply(`${e}`)
}
})